###################################################################

# Created by write_sdc on Sat Jan 17 06:32:41 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance 1.000000e+04kOhm -capacitance 1.000000e-04pF    \
-voltage V -current uA
create_clock [get_ports clk]  -period 27  -waveform {0 13.5}
set_clock_uncertainty 0.2  [get_clocks clk]
set_false_path   -from [get_ports rst_n]
set_input_delay -clock clk  0  [get_ports csr_we]
set_input_delay -clock clk  0  [get_ports csr_re]
set_input_delay -clock clk  0  [get_ports {csr_addr[7]}]
set_input_delay -clock clk  0  [get_ports {csr_addr[6]}]
set_input_delay -clock clk  0  [get_ports {csr_addr[5]}]
set_input_delay -clock clk  0  [get_ports {csr_addr[4]}]
set_input_delay -clock clk  0  [get_ports {csr_addr[3]}]
set_input_delay -clock clk  0  [get_ports {csr_addr[2]}]
set_input_delay -clock clk  0  [get_ports {csr_addr[1]}]
set_input_delay -clock clk  0  [get_ports {csr_addr[0]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[31]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[30]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[29]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[28]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[27]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[26]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[25]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[24]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[23]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[22]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[21]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[20]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[19]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[18]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[17]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[16]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[15]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[14]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[13]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[12]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[11]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[10]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[9]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[8]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[7]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[6]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[5]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[4]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[3]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[2]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[1]}]
set_input_delay -clock clk  0  [get_ports {csr_wdata[0]}]
set_input_delay -clock clk  0  [get_ports n_en_b]
set_input_delay -clock clk  0  [get_ports n_we_b]
set_input_delay -clock clk  0  [get_ports {n_addr_b[7]}]
set_input_delay -clock clk  0  [get_ports {n_addr_b[6]}]
set_input_delay -clock clk  0  [get_ports {n_addr_b[5]}]
set_input_delay -clock clk  0  [get_ports {n_addr_b[4]}]
set_input_delay -clock clk  0  [get_ports {n_addr_b[3]}]
set_input_delay -clock clk  0  [get_ports {n_addr_b[2]}]
set_input_delay -clock clk  0  [get_ports {n_addr_b[1]}]
set_input_delay -clock clk  0  [get_ports {n_addr_b[0]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[31]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[30]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[29]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[28]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[27]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[26]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[25]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[24]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[23]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[22]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[21]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[20]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[19]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[18]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[17]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[16]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[15]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[14]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[13]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[12]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[11]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[10]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[9]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[8]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[7]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[6]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[5]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[4]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[3]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[2]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[1]}]
set_input_delay -clock clk  0  [get_ports {n_wdata_b[0]}]
set_input_delay -clock clk  0  [get_ports {n_be_b[3]}]
set_input_delay -clock clk  0  [get_ports {n_be_b[2]}]
set_input_delay -clock clk  0  [get_ports {n_be_b[1]}]
set_input_delay -clock clk  0  [get_ports {n_be_b[0]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[31]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[30]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[29]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[28]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[27]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[26]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[25]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[24]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[23]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[22]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[21]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[20]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[19]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[18]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[17]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[16]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[15]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[14]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[13]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[12]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[11]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[10]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[9]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[8]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[7]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[6]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[5]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[4]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[3]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[2]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[1]}]
set_output_delay -clock clk  0  [get_ports {csr_rdata[0]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[31]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[30]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[29]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[28]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[27]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[26]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[25]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[24]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[23]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[22]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[21]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[20]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[19]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[18]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[17]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[16]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[15]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[14]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[13]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[12]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[11]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[10]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[9]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[8]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[7]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[6]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[5]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[4]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[3]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[2]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[1]}]
set_output_delay -clock clk  0  [get_ports {n_rdata_b[0]}]
